In [23]:
import pandas as pd
import numpy as np

In [24]:
sozlukVerisi = {"İstanbul" : [30, 29, np.nan], "Ankara" : [20, np.nan, 25], "İzmir" : [40, 39, 38]}
havaDurumuDataFrame = pd.DataFrame(sozlukVerisi)

In [25]:
havaDurumuDataFrame

   İstanbul  Ankara  İzmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [26]:
havaDurumuDataFrame.dropna()

   İstanbul  Ankara  İzmir
0      30.0    20.0     40

nan olan satırlar çıktı

In [27]:
havaDurumuDataFrame

   İstanbul  Ankara  İzmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [28]:
havaDurumuDataFrame.dropna(axis = 1)

   İzmir
0     40
1     39
2     38

In [29]:
yeniSozlukVerisi = {"İstanbul" : [30, 29, np.nan], "Ankara" : [20, np.nan, 25], "İzmir" : [40, 39, 38], "Antalya" : [45, np.nan, np.nan]}
yeniHavaDurumuDataFrame = pd.DataFrame(yeniSozlukVerisi)

In [30]:
yeniHavaDurumuDataFrame

   İstanbul  Ankara  İzmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [31]:
yeniHavaDurumuDataFrame.dropna(axis = 1, thresh = 2)

   İstanbul  Ankara  İzmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

thresh = 2 limittir. 2 ve üzeri nan olanları at

In [32]:
yeniHavaDurumuDataFrame

   İstanbul  Ankara  İzmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [33]:
yeniHavaDurumuDataFrame.fillna(20)

   İstanbul  Ankara  İzmir  Antalya
0      30.0    20.0     40     45.0
1      29.0    20.0     39     20.0
2      20.0    25.0     38     20.0

boş olanları doldurdum

## groupby

In [54]:
maasSozlugu = {"Departman" : ["Yazılım", "Yazılım", "Pazarlama", "Pazarlama" ,"Hukuk", "Hukuk"],
               "Çalışan İsimleri" : ["Ahmet", "Mehmet", "Atıl", "Burak","Zeynep","Fatma"],
               "Maaş" : [100, 150, 200, 300, 400, 500]}

In [55]:
maasDataFrame = pd.DataFrame(maasSozlugu)

In [56]:
maasDataFrame

   Departman Çalışan İsimleri  Maaş
0    Yazılım            Ahmet   100
1    Yazılım           Mehmet   150
2  Pazarlama             Atıl   200
3  Pazarlama            Burak   300
4      Hukuk           Zeynep   400
5      Hukuk            Fatma   500

In [57]:
grupObjesi = maasDataFrame.groupby("Departman")

maasDataFrame.

In [58]:
grupObjesi.count()

           Çalışan İsimleri  Maaş
Departman
Hukuk                     2     2
Pazarlama                 2     2
Yazılım                   2     2

In [59]:
grupObjesi.mean("Maaş")

            Maaş
Departman
Hukuk      450.0
Pazarlama  250.0
Yazılım    125.0

In [60]:
grupObjesi.min()

          Çalışan İsimleri  Maaş
Departman
Hukuk                Fatma   400
Pazarlama             Atıl   200
Yazılım              Ahmet   100

In [61]:
grupObjesi.describe()

           Maaş
          count   mean        std    min    25%    50%    75%    max
Departman
Hukuk       2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
Pazarlama   2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
Yazılım     2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0